1.8.xx/package/tau_modules/app_tr069/src/sample/get_IPping.xml

<soap:Envelope 
			soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" 
			xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
			xmlns:cwmp="urn:dslforum-org:cwmp-1-0" 
			xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Header>
    <cwmp:ID soap:mustUnderstand="1">3D8D198B69F94D7BB2A9266408481BE9</cwmp:ID>
  </soap:Header>
  <soap:Body>
	<cwmp:GetParameterValues>
      <ParameterNames soapenc:arrayType="xsd:string[1]">
<string>InternetGatewayDevice.IPPingDiagnostics.DiagnosticsState</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.Interface</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.Host</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.NumberOfRepetitions</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.Timeout</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.DataBlockSize</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.DSCP</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.SuccessCount</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.FailureCount</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.AverageResponseTime</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.MinimumResponseTime</string>
	<string>InternetGatewayDevice.IPPingDiagnostics.MaximumResponseTime</string> 
	</ParameterNames>
      </cwmp:GetParameterValues>
  </soap:Body>
</soap:Envelope>
InternetGatewayDevice.IPPingDiagnostics.Host